Revit 2024 API
ElementNode.LinkInstanceId Property
 The Id of the link instance for the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public ElementId LinkInstanceId { get; }
Visual Basic
Public ReadOnly Property LinkInstanceId As ElementId
	Get
Visual C++
public:
property ElementId^ LinkInstanceId {
	ElementId^ get ();
}
See Also
ElementNode Class
Autodesk.Revit.DB Namespace